<?php 

class GetTypes {
    function __construct() {
        $this->types = array(
            "СЭС" => "SES",
            "Солнце+ветер" => "SV",
            "Солнце+дизель" => "SD",
            "Солнце-ветер-дилзель" => "SVD",
            "Водонагреватель" => "SVU",
            "ВЭС" => "VES",
            "Ветер+дизель" => "VDES",
            "Био" => "BIO",
            "Био-кластер" => "BIOC",
            "Гео" => "GEOE",
            "Насос" => "TN",
            "Насос+вода" => "TNSVU",
            "Приливная" => "PES",
            "Малая ГЭМ" => "MGES"           
        );

        $this->test = "Hello";
    }

}
?>